05-cxf/TestRequest

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <soapenv:Header>
    <wsse:Security>
      <wsse:UsernameToken>
        <wsse:Username>Athlete1</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">aaa111</wsse:Password>
      </wsse:UsernameToken>
     </wsse:Security>
  </soapenv:Header>
   <soapenv:Body>
      <hom:generateETicket xmlns:hom="http://homework5service/">
         <athleteId>1</athleteId>
      </hom:generateETicket>
   </soapenv:Body>
</soapenv:Envelope>